// сем3_дз.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
void n1();
void n2();
void n3();
void n4();
void n5();
void n6();
void n7();
void n8();

int main()
{
    std::cout << "task 1 \n";
    //n1();
    std::cout << "\ntask 2 \n";
    //n2();
    std::cout << "\ntask 3 \n";
    //n3();
    std::cout << "\ntask 4 \n";
    //n4();
    std::cout << "\ntask 5 \n";
    //n5();
    std::cout << "\ntask 6 \n";
    //n6();
    std::cout << "\ntask 7 \n";
    //n7();
    std::cout << "\ntask 8 \n";
    n8();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
